dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDom_reg.h
/** \brief 20, Protocol Error Control Register 1 */
#define DOM2_SCICTRL1_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700020u)
/** Alias (User Manual Name) for DOM2_SCICTRL1_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL1_PECON.
*/
#define DOM2_PECON1 (DOM2_SCICTRL1_PECON)

/** \brief 28, SCI1 Arbiter Priority Register */
#define DOM2_SCICTRL1_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700028u)
/** Alias (User Manual Name) for DOM2_SCICTRL1_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL1_PRIORITY.
*/
#define DOM2_PRIORITY1 (DOM2_SCICTRL1_PRIORITY)

/** \brief 30, SCI 1 Error Address Capture Register */
#define DOM2_SCICTRL1_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700030u)
/** Alias (User Manual Name) for DOM2_SCICTRL1_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL1_ERRADDR.
*/
#define DOM2_ERRADDR1 (DOM2_SCICTRL1_ERRADDR)

/** \brief 38, SCI 1 Error Capture Register */
#define DOM2_SCICTRL1_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700038u)
/** Alias (User Manual Name) for DOM2_SCICTRL1_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL1_ERR.
*/
#define DOM2_ERR1 (DOM2_SCICTRL1_ERR)

/** \brief 40, Protocol Error Control Register 2 */
#define DOM2_SCICTRL2_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700040u)
/** Alias (User Manual Name) for DOM2_SCICTRL2_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL2_PECON.
*/
#define DOM2_PECON2 (DOM2_SCICTRL2_PECON)

/** \brief 48, SCI2 Arbiter Priority Register */
#define DOM2_SCICTRL2_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700048u)
/** Alias (User Manual Name) for DOM2_SCICTRL2_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL2_PRIORITY.
*/
#define DOM2_PRIORITY2 (DOM2_SCICTRL2_PRIORITY)

/** \brief 50, SCI 2 Error Address Capture Register */
#define DOM2_SCICTRL2_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700050u)
/** Alias (User Manual Name) for DOM2_SCICTRL2_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL2_ERRADDR.
*/
#define DOM2_ERRADDR2 (DOM2_SCICTRL2_ERRADDR)

/** \brief 58, SCI 2 Error Capture Register */
#define DOM2_SCICTRL2_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700058u)
/** Alias (User Manual Name) for DOM2_SCICTRL2_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL2_ERR.
*/
#define DOM2_ERR2 (DOM2_SCICTRL2_ERR)

/** \brief 60, Protocol Error Control Register 3 */
#define DOM2_SCICTRL3_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700060u)
/** Alias (User Manual Name) for DOM2_SCICTRL3_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL3_PECON.
*/
#define DOM2_PECON3 (DOM2_SCICTRL3_PECON)

/** \brief 68, SCI3 Arbiter Priority Register */
#define DOM2_SCICTRL3_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700068u)
/** Alias (User Manual Name) for DOM2_SCICTRL3_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL3_PRIORITY.
*/
#define DOM2_PRIORITY3 (DOM2_SCICTRL3_PRIORITY)

/** \brief 70, SCI 3 Error Address Capture Register */
#define DOM2_SCICTRL3_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700070u)
/** Alias (User Manual Name) for DOM2_SCICTRL3_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL3_ERRADDR.
*/
#define DOM2_ERRADDR3 (DOM2_SCICTRL3_ERRADDR)

/** \brief 78, SCI 3 Error Capture Register */
#define DOM2_SCICTRL3_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700078u)
/** Alias (User Manual Name) for DOM2_SCICTRL3_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL3_ERR.
*/
#define DOM2_ERR3 (DOM2_SCICTRL3_ERR)

/** \brief 80, Protocol Error Control Register 4 */
#define DOM2_SCICTRL4_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700080u)
/** Alias (User Manual Name) for DOM2_SCICTRL4_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL4_PECON.
*/
#define DOM2_PECON4 (DOM2_SCICTRL4_PECON)

/** \brief 88, SCI4 Arbiter Priority Register */
#define DOM2_SCICTRL4_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700088u)
/** Alias (User Manual Name) for DOM2_SCICTRL4_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL4_PRIORITY.
*/
#define DOM2_PRIORITY4 (DOM2_SCICTRL4_PRIORITY)

/** \brief 90, SCI 4 Error Address Capture Register */
#define DOM2_SCICTRL4_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700090u)
/** Alias (User Manual Name) for DOM2_SCICTRL4_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL4_ERRADDR.
*/
#define DOM2_ERRADDR4 (DOM2_SCICTRL4_ERRADDR)

/** \brief 98, SCI 4 Error Capture Register */
#define DOM2_SCICTRL4_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB700098u)
/** Alias (User Manual Name) for DOM2_SCICTRL4_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL4_ERR.
*/
#define DOM2_ERR4 (DOM2_SCICTRL4_ERR)

/** \brief A0, Protocol Error Control Register 5 */
#define DOM2_SCICTRL5_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000A0u)
/** Alias (User Manual Name) for DOM2_SCICTRL5_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL5_PECON.
*/
#define DOM2_PECON5 (DOM2_SCICTRL5_PECON)

/** \brief A8, SCI5 Arbiter Priority Register */
#define DOM2_SCICTRL5_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000A8u)
/** Alias (User Manual Name) for DOM2_SCICTRL5_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL5_PRIORITY.
*/
#define DOM2_PRIORITY5 (DOM2_SCICTRL5_PRIORITY)

/** \brief B0, SCI 5 Error Address Capture Register */
#define DOM2_SCICTRL5_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000B0u)
/** Alias (User Manual Name) for DOM2_SCICTRL5_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL5_ERRADDR.
*/
#define DOM2_ERRADDR5 (DOM2_SCICTRL5_ERRADDR)

/** \brief B8, SCI 5 Error Capture Register */
#define DOM2_SCICTRL5_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000B8u)
/** Alias (User Manual Name) for DOM2_SCICTRL5_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL5_ERR.
*/
#define DOM2_ERR5 (DOM2_SCICTRL5_ERR)

/** \brief C0, Protocol Error Control Register 6 */
#define DOM2_SCICTRL6_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000C0u)
/** Alias (User Manual Name) for DOM2_SCICTRL6_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL6_PECON.
*/
#define DOM2_PECON6 (DOM2_SCICTRL6_PECON)

/** \brief C8, SCI6 Arbiter Priority Register */
#define DOM2_SCICTRL6_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000C8u)
/** Alias (User Manual Name) for DOM2_SCICTRL6_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL6_PRIORITY.
*/
#define DOM2_PRIORITY6 (DOM2_SCICTRL6_PRIORITY)

/** \brief D0, SCI 6 Error Address Capture Register */
#define DOM2_SCICTRL6_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000D0u)
/** Alias (User Manual Name) for DOM2_SCICTRL6_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL6_ERRADDR.
*/
#define DOM2_ERRADDR6 (DOM2_SCICTRL6_ERRADDR)

/** \brief D8, SCI 6 Error Capture Register */
#define DOM2_SCICTRL6_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000D8u)
/** Alias (User Manual Name) for DOM2_SCICTRL6_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL6_ERR.
*/
#define DOM2_ERR6 (DOM2_SCICTRL6_ERR)

/** \brief E0, Protocol Error Control Register 7 */
#define DOM2_SCICTRL7_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB7000E0u)
/** Alias (User Manual Name) for DOM2_SCICTRL7_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL7_PECON.
*/
#define DOM2_PECON7 (DOM2_SCICTRL7_PECON)

/** \brief E8, SCI7 Arbiter Priority Register */
#define DOM2_SCICTRL7_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB7000E8u)
/** Alias (User Manual Name) for DOM2_SCICTRL7_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL7_PRIORITY.
*/
#define DOM2_PRIORITY7 (DOM2_SCICTRL7_PRIORITY)

/** \brief F0, SCI 7 Error Address Capture Register */
#define DOM2_SCICTRL7_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB7000F0u)
/** Alias (User Manual Name) for DOM2_SCICTRL7_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL7_ERRADDR.
*/
#define DOM2_ERRADDR7 (DOM2_SCICTRL7_ERRADDR)

/** \brief F8, SCI 7 Error Capture Register */
#define DOM2_SCICTRL7_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERR*)0xFB7000F8u)
/** Alias (User Manual Name) for DOM2_SCICTRL7_ERR.
* To use register names with standard convension, please use DOM2_SCICTRL7_ERR.
*/
#define DOM2_ERR7 (DOM2_SCICTRL7_ERR)

/** \brief 100, Protocol Error Control Register 8 */
#define DOM2_SCICTRL8_PECON /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PECON*)0xFB700100u)
/** Alias (User Manual Name) for DOM2_SCICTRL8_PECON.
* To use register names with standard convension, please use DOM2_SCICTRL8_PECON.
*/
#define DOM2_PECON8 (DOM2_SCICTRL8_PECON)

/** \brief 108, SCI8 Arbiter Priority Register */
#define DOM2_SCICTRL8_PRIORITY /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_PRIORITY*)0xFB700108u)
/** Alias (User Manual Name) for DOM2_SCICTRL8_PRIORITY.
* To use register names with standard convension, please use DOM2_SCICTRL8_PRIORITY.
*/
#define DOM2_PRIORITY8 (DOM2_SCICTRL8_PRIORITY)

/** \brief 110, SCI 8 Error Address Capture Register */
#define DOM2_SCICTRL8_ERRADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_DOM_SCICTRL_ERRADDR*)0xFB700110u)
/** Alias (User Manual Name) for DOM2_SCICTRL8_ERRADDR.
* To use register names with standard convension, please use DOM2_SCICTRL8_ERRADDR.
*/
#define DOM2_ERRADDR8 (DOM2_SCICTRL8_ERRADDR)

